DB_DSN := postgres://postgres:postgres@localhost:5432/task_api?sslmode=disable
MIGRATE := migrate -path ./migrations -database "$(DB_DSN)"

migrate-new:
	migrate create -ext sql -dir ./migrations $(NAME)

	# migrate-new - это цель Makefile, которая создает новую миграцию с помощью инструмента migrate. 
	# Она принимает аргумент NAME, который указывает имя новой миграции. Команда migrate create генерирует два файла: 
	# один для применения миграции (up) и другой для отката миграции (down), оба с расширением .sql и помещает их в директорию ./migrations.

migrate:
	$(MIGRATE) up 

	# migrate - это цель Makefile, которая выполняет все миграции в директории ./migrations, применяя их к базе данных, указанной в переменной DB_DSN.
	# Команда $(MIGRATE) up запускает процесс миграции, который последовательно применяет все миграции, которые еще не были применены к базе данных. 
	# Это позволяет обновить структуру базы данных в соответствии с определенными миграциями.

migrate-down:
	$(MIGRATE) down 

	# migrate-down - это цель Makefile, которая откатывает все миграции в директории ./migrations, возвращая базу данных к предыдущему состоянию.
	# Команда $(MIGRATE) down запускает процесс отката миграции, который последовательно откатывает все миграции, которые были применены к базе данных. 
	# Это может быть полезно для восстановления базы данных в случае ошибок или для тестирования процесса миграции.

migrate-down-one:
	$(MIGRATE) down 1

	# migrate-down-one - это цель Makefile, которая откатывает последнюю примененную миграцию в директории ./migrations, возвращая базу данных к предыдущему состоянию.
	# Команда $(MIGRATE) down 1 запускает процесс отката миграции, который откатывает только одну последнюю примененную миграцию. 
	# Это может быть полезно для восстановления базы данных в случае ошибок, связанных с последней миграцией, или для тестирования процесса миграции.

run:
	go run cmd/api/main.go

	# run - это цель Makefile, которая запускает основное приложение, используя команду go run. 
	# Команда go run cmd/api/main.go компилирует и выполняет файл main.go, который находится в директории cmd/api. 
	# Это позволяет запустить сервер или приложение, определенное в main.go, и начать его работу.

gen:
	if not exist internal\httpapi\gen mkdir internal\httpapi\gen
	go run github.com/oapi-codegen/oapi-codegen/v2/cmd/oapi-codegen@v2.4.1 -config oapi-codegen.yaml openapi.yaml

	# gen - это цель Makefile, которая генерирует код на основе спецификации OpenAPI, используя инструмент oapi-codegen.
	# Первая строка проверяет, существует ли директория internal\httpapi\gen, и если она не существует, создает ее. Вторая строка запускает команду go run для выполнения 
	# инструмента oapi-codegen с указанием конфигурационного файла oapi-codegen.yaml и спецификации OpenAPI, которая находится в файле openapi.yaml.